zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_system.h
/**
  ******************************************************************************
  * @file    stm32mp13xx_ll_system.h
  * @author  MCD Application Team
  * @brief   Header file of SYSTEM LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
    [..]
    The LL SYSTEM driver contains a set of generic APIs that can be
    used by user:
      (+) Access to DBGCMU registers
      (+) Access to SYSCFG registers

  @endverbatim
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP13xx_LL_SYSTEM_H
#define STM32MP13xx_LL_SYSTEM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx.h"

/** @addtogroup STM32MP13xx_LL_Driver
  * @{
  */

#if defined (SYSCFG) || defined (DBGMCU)

/** @defgroup SYSTEM_LL SYSTEM
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Private_Constants SYSTEM Private Constants
  * @{
  */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Constants SYSTEM Exported Constants
  * @{
  */

/** @defgroup SYSTEM_LL_EC_BOOT_PIN SYSCFG Boot Pin code selection
  * @{
  */
#define LL_SYSCFG_BOOT0           SYSCFG_BOOTR_BOOT0       /*!< BOOT0 pin connected to VDD */
#define LL_SYSCFG_BOOT1           SYSCFG_BOOTR_BOOT1       /*!< BOOT1 pin connected to VDD */
#define LL_SYSCFG_BOOT2           SYSCFG_BOOTR_BOOT2       /*!< BOOT2 pin connected to VDD */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_I2C_FASTMODEPLUS SYSCFG I2C FASTMODEPLUS
  * @{
  */
#define LL_SYSCFG_I2C_FASTMODEPLUS_I2C1        SYSCFG_PMCSETR_I2C1_FMP       /*!< Enable Fast Mode Plus for I2C1      */
#define LL_SYSCFG_I2C_FASTMODEPLUS_I2C2        SYSCFG_PMCSETR_I2C2_FMP       /*!< Enable Fast Mode Plus for I2C2      */
#define LL_SYSCFG_I2C_FASTMODEPLUS_I2C3        SYSCFG_PMCSETR_I2C3_FMP       /*!< Enable Fast Mode Plus for I2C3      */
#define LL_SYSCFG_I2C_FASTMODEPLUS_I2C4        SYSCFG_PMCSETR_I2C4_FMP       /*!< Enable Fast Mode Plus for I2C4      */
#define LL_SYSCFG_I2C_FASTMODEPLUS_I2C5        SYSCFG_PMCSETR_I2C5_FMP       /*!< Enable Fast Mode Plus for I2C5      */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_ETHERNET_PHY Ethernet PHY Interface Selection
  * @{
  */
#define LL_SYSCFG_ETH1_MII               0x00000000U                        /*!< Enable ETH1 Media MII interface */
#define LL_SYSCFG_ETH1_RGMII             SYSCFG_PMCSETR_ETH1_SEL_0          /*!< Enable ETH1 Media RGMII interface */
#define LL_SYSCFG_ETH1_RMII              SYSCFG_PMCSETR_ETH1_SEL_2          /*!< Enable ETH1 Media RMII interface */
#define LL_SYSCFG_ETH2_MII               0x00000000U                        /*!< Enable ETH2 Media MII interface */
#define LL_SYSCFG_ETH2_RGMII             SYSCFG_PMCSETR_ETH2_SEL_0          /*!< Enable ETH2 Media RGMII interface */
#define LL_SYSCFG_ETH2_RMII              SYSCFG_PMCSETR_ETH2_SEL_2          /*!< Enable ETH2 Media RMII interface */

/**
  * @}
  */


/** @defgroup SYSTEM_LL_EC_ETHERNET_CLK Ethernet CLK Mode Selection
  * @{
  */
#define LL_SYSCFG_ETH1_CLK               SYSCFG_PMCSETR_ETH1_CLK_SEL           /*!< Enable ETH1 clock selection */
#define LL_SYSCFG_ETH1_REF_CLK           SYSCFG_PMCSETR_ETH1_REF_CLK_SEL       /*!< Enable ETH1 REF clock selection */
#define LL_SYSCFG_ETH2_CLK               SYSCFG_PMCSETR_ETH2_CLK_SEL           /*!< Enable ETH2 clock selection */
#define LL_SYSCFG_ETH2_REF_CLK           SYSCFG_PMCSETR_ETH2_REF_CLK_SEL       /*!< Enable ETH2 REF clock selection */

/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_TIMBREAK SYSCFG TIMER BREAK
  * @{
  */
#define LL_SYSCFG_TIMBREAK_PVD             SYSCFG_CBR_PVDL    /*!< Enables and locks the PVD connection
                                                                   with TIM1/8/15/16/17 Break Input
                                                                   and also the PVDE and PLS bits of the
                                                                   Power Control Interface */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_IO_COMPENSATION SYSCFG I/O compensation cell code selection
  * @{
  */
#define LL_SYSCFG_CELL_CODE               0U                     /*!< Disable Compensation Software Control */
#define LL_SYSCFG_REGISTER_CODE           SYSCFG_CMPCR_SW_CTRL   /*!< Enable Compensation Software Control */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_COMPENSATION_CELL SYSCFG compensation cell control register
  * @{
  */
#define LL_SYSCFG_MAIN_COMP_CELL               (0x1U << 1)
#define LL_SYSCFG_SD1_COMP_CELL                (0x1U << 2)
#define LL_SYSCFG_SD2_COMP_CELL                (0x1U << 3)
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_HSLV SYSCFG High Speed Low Voltage Config
  * @{
  */
#define LL_SYSCFG_HIGHSPEED_TRACE_SIGNAL   (0x1U << 0)   /*!< High Speed Low Voltage Pad mode Enable when a TRACEx signal is selected in AFMUX */
#define LL_SYSCFG_HIGHSPEED_QSPI_SIGNAL    (0x1U << 1)   /*!< High Speed Low Voltage Pad mode Enable when a QUADSPI_x signal is selected in AFMUX */
#define LL_SYSCFG_HIGHSPEED_ETH1_SIGNAL    (0x1U << 2)   /*!< High Speed Low Voltage Pad mode Enable when a ETH_x signal is selected in AFMUX */
#define LL_SYSCFG_HIGHSPEED_ETH2_SIGNAL    (0x1U << 3)   /*!< High Speed Low Voltage Pad mode Enable when a ETH_x signal is selected in AFMUX */
#define LL_SYSCFG_HIGHSPEED_SDMMC1_SIGNAL  (0x1U << 4)   /*!< High Speed Low Voltage Pad mode Enable when a SDMMCy_x signal is selected in AFMUX */
#define LL_SYSCFG_HIGHSPEED_SDMMC2_SIGNAL  (0x1U << 5)   /*!< High Speed Low Voltage Pad mode Enable when a SDMMCy_x signal is selected in AFMUX */
#define LL_SYSCFG_HIGHSPEED_SPI1_SIGNAL    (0x1U << 6)   /*!< High Speed Low Voltage Pad mode Enable when a SPIy_x signal is selected in AFMUX */
#define LL_SYSCFG_HIGHSPEED_SPI2_SIGNAL    (0x1U << 7)   /*!< High Speed Low Voltage Pad mode Enable when a SPIy_x signal is selected in AFMUX */
#define LL_SYSCFG_HIGHSPEED_SPI3_SIGNAL    (0x1U << 8)   /*!< High Speed Low Voltage Pad mode Enable when a SPIy_x signal is selected in AFMUX */
#define LL_SYSCFG_HIGHSPEED_SPI4_SIGNAL    (0x1U << 9)   /*!< High Speed Low Voltage Pad mode Enable when a SPIy_x signal is selected in AFMUX */
#define LL_SYSCFG_HIGHSPEED_SPI5_SIGNAL    (0x1U << 10)  /*!< High Speed Low Voltage Pad mode Enable when a SPIy_x signal is selected in AFMUX */
#define LL_SYSCFG_HIGHSPEED_LTDC_SIGNAL    (0x1U << 11)  /*!< High Speed Low Voltage Pad mode Enable when a LTDCy_x signal is selected in AFMUX */

/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB1_GRP1_STOP_IP DBGMCU APB1 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB1_GRP1_TIM2_STOP      DBGMCU_APB1_FZ_DBG_TIM2_STOP     /*!< TIM2 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM3_STOP      DBGMCU_APB1_FZ_DBG_TIM3_STOP     /*!< TIM3 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM4_STOP      DBGMCU_APB1_FZ_DBG_TIM4_STOP     /*!< TIM4 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM5_STOP      DBGMCU_APB1_FZ_DBG_TIM5_STOP     /*!< TIM5 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM6_STOP      DBGMCU_APB1_FZ_DBG_TIM6_STOP     /*!< TIM6 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_TIM7_STOP      DBGMCU_APB1_FZ_DBG_TIM7_STOP     /*!< TIM7 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_LPTIM1_STOP    DBGMCU_APB1_FZ_DBG_LPTIM1_STOP   /*!< LPTIM1 counter stopped when core is halted */
#define LL_DBGMCU_APB1_GRP1_I2C1_STOP      DBGMCU_APB1_FZ_DBG_I2C1_STOP     /*!< I2C1 SMBUS timeout mode stopped when Core is halted */
#define LL_DBGMCU_APB1_GRP1_I2C2_STOP      DBGMCU_APB1_FZ_DBG_I2C2_STOP     /*!< I2C2 SMBUS timeout mode stopped when Core is halted */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB2_GRP1_STOP_IP DBGMCU APB2 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB2_GRP1_TIM1_STOP     DBGMCU_APB2_FZ_DBG_TIM1_STOP     /*!< TIM1 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB2_GRP1_TIM8_STOP     DBGMCU_APB2_FZ_DBG_TIM8_STOP     /*!< TIM8 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB2_GRP1_FDCAN_STOP    DBGMCU_APB2_FZ_DBG_FDCAN_STOP    /*!< FDCAN is frozen while the core is in debug mode */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB3_GRP1_STOP_IP DBGMCU APB3 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB3_GRP1_LPTIM2_STOP     DBGMCU_APB3_FZ_DBG_LPTIM2_STOP   /*!< LPTIM2 counter stopped when core is halted */
#define LL_DBGMCU_APB3_GRP1_LPTIM3_STOP     DBGMCU_APB3_FZ_DBG_LPTIM3_STOP   /*!< LPTIM3 counter stopped when core is halted */
#define LL_DBGMCU_APB3_GRP1_LPTIM4_STOP     DBGMCU_APB3_FZ_DBG_LPTIM4_STOP   /*!< LPTIM4 counter stopped when core is halted */
#define LL_DBGMCU_APB3_GRP1_LPTIM5_STOP     DBGMCU_APB3_FZ_DBG_LPTIM5_STOP   /*!< LPTIM5 counter stopped when core is halted */
/**
  * @}
  */

