zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_system.h
/** @defgroup SYSTEM_LL_EC_APB4_GRP1_STOP_IP DBGMCU APB4 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB4_GRP1_IWDG2_STOP      DBGMCU_APB4_FZ_DBG_IWDG2_STOP     /*!< IWDG2 is frozen while the core is in debug mode */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB5_GRP1_STOP_IP DBGMCU APB5 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB5_GRP1_IWDG1_STOP      DBGMCU_APB5_FZ_DBG_IWDG1_STOP     /*!< IWDG1 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB5_GRP1_RTC_STOP        DBGMCU_APB5_FZ_DBG_RTC_STOP       /*!< RTC is frozen while the core is in debug mode */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB6_GRP1_STOP_IP DBGMCU APB6 GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB6_GRP1_I2C3_STOP      DBGMCU_APB6_FZ_DBG_I2C3_STOP      /*!< I2C3 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB6_GRP1_I2C4_STOP      DBGMCU_APB6_FZ_DBG_I2C4_STOP      /*!< I2C4 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB6_GRP1_I2C5_STOP      DBGMCU_APB6_FZ_DBG_I2C5_STOP      /*!< I2C5 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB6_GRP1_TIM12_STOP     DBGMCU_APB6_FZ_DBG_TIM12_STOP     /*!< TIM12 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB6_GRP1_TIM13_STOP     DBGMCU_APB6_FZ_DBG_TIM13_STOP     /*!< TIM13 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB6_GRP1_TIM14_STOP     DBGMCU_APB6_FZ_DBG_TIM14_STOP     /*!< TIM14 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB6_GRP1_TIM15_STOP     DBGMCU_APB6_FZ_DBG_TIM15_STOP     /*!< TIM15 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB6_GRP1_TIM16_STOP     DBGMCU_APB6_FZ_DBG_TIM16_STOP     /*!< TIM16 is frozen while the core is in debug mode */
#define LL_DBGMCU_APB6_GRP1_TIM17_STOP     DBGMCU_APB6_FZ_DBG_TIM17_STOP     /*!< TIM17 is frozen while the core is in debug mode */
/**
  * @}
  */
/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Functions SYSTEM Exported Functions
  * @{
  */

/** @defgroup SYSTEM_LL_EF_SYSCFG SYSCFG
  * @{
  */

/**
  * @brief  Get boot pin value connected to VDD
  * @rmtoll SYSCFG_BOOTR   BOOTx   LL_SYSCFG_GetBootPinValueToVDD
  * @param  BootPinValue This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_BOOT0
  *         @arg @ref LL_SYSCFG_BOOT1
  *         @arg @ref LL_SYSCFG_BOOT2
  * @retval None
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetBootPinValueToVDD(uint16_t BootPinValue)
{
  return (uint32_t)(READ_BIT(SYSCFG->BOOTR, BootPinValue));
}

/**
  * @brief  Set Ethernet1 PHY interface
  * @rmtoll SYSCFG_PMCSETR   ETH1_SEL      LL_SYSCFG_SetPHYInterfaceETH1
  * @param  Interface : Interface This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH1_MII
  *         @arg @ref LL_SYSCFG_ETH1_RGMII
  *         @arg @ref LL_SYSCFG_ETH1_RMII
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetPHYInterfaceETH1(uint32_t Interface)
{
  MODIFY_REG(SYSCFG->PMCCLRR, SYSCFG_PMCCLRR_ETH1_SEL, SYSCFG_PMCCLRR_ETH1_SEL);
  MODIFY_REG(SYSCFG->PMCSETR, SYSCFG_PMCSETR_ETH1_SEL, Interface);
}

/**
  * @brief  Get Ethernet1 PHY interface
  * @rmtoll SYSCFG_PMCSETR   ETH1_SEL      LL_SYSCFG_GetPHYInterfaceETH1
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH1_MII
  *         @arg @ref LL_SYSCFG_ETH1_RMII
  *         @arg @ref LL_SYSCFG_ETH1_RGMII
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPHYInterfaceETH1(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->PMCSETR, SYSCFG_PMCSETR_ETH1_SEL));
}

/**
  * @brief  Clear Ethernet1 PHY mode
  * @rmtoll SYSCFG_PMCSETR   ETH1_SEL      LL_SYSCFG_ClearPHYInterfaceETH1
  * @param  Interface : Interface This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH1_MII
  *         @arg @ref LL_SYSCFG_ETH1_RGMII
  *         @arg @ref LL_SYSCFG_ETH1_RMII
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_ClearPHYInterfaceETH1(uint32_t Interface)
{
  MODIFY_REG(SYSCFG->PMCCLRR, SYSCFG_PMCCLRR_ETH1_SEL, Interface);
}

/**
  * @brief  Disable Ethernet1 clock
  * @rmtoll SYSCFG_PMCCLRR   ETH1_CLK_SEL       LL_SYSCFG_DisablePHYInternalClockETH1\n
  *         SYSCFG_PMCCLRR   ETH1_REF_CLK_SEL   LL_SYSCFG_DisablePHYInternalClockETH1
  * @param  Clock : This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH1_CLK
  *         @arg @ref LL_SYSCFG_ETH1_REF_CLK
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisablePHYInternalClockETH1(uint32_t Clock)
{
  MODIFY_REG(SYSCFG->PMCCLRR, (SYSCFG_PMCCLRR_ETH1_CLK_SEL | SYSCFG_PMCCLRR_ETH1_REF_CLK_SEL), Clock);
}

/**
  * @brief  Enable Ethernet1 clock
  * @rmtoll SYSCFG_PMCSETR   ETH1_CLK_SEL       LL_SYSCFG_EnablePHYInternalClockETH1\n
  *         SYSCFG_PMCSETR   ETH1_REF_CLK_SEL   LL_SYSCFG_EnablePHYInternalClockETH1
  * @param  Clock : This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH1_CLK
  *         @arg @ref LL_SYSCFG_ETH1_REF_CLK
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnablePHYInternalClockETH1(uint32_t Clock)
{
  MODIFY_REG(SYSCFG->PMCSETR, (SYSCFG_PMCSETR_ETH1_CLK_SEL | SYSCFG_PMCSETR_ETH1_REF_CLK_SEL), Clock);
}

/**
  * @brief  Set Ethernet2 PHY interface
  * @rmtoll SYSCFG_PMCSETR   ETH2_SEL      LL_SYSCFG_SetPHYInterfaceETH2
  * @param  Interface : Interface This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH2_MII
  *         @arg @ref LL_SYSCFG_ETH2_RGMII
  *         @arg @ref LL_SYSCFG_ETH2_RMII
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetPHYInterfaceETH2(uint32_t Interface)
{
  MODIFY_REG(SYSCFG->PMCCLRR, SYSCFG_PMCCLRR_ETH2_SEL, SYSCFG_PMCCLRR_ETH2_SEL);
  MODIFY_REG(SYSCFG->PMCSETR, SYSCFG_PMCSETR_ETH2_SEL, Interface);
}

/**
  * @brief  Get Ethernet2 PHY interface
  * @rmtoll SYSCFG_PMCSETR   ETH2_SEL      LL_SYSCFG_GetPHYInterfaceETH2
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH2_MII
  *         @arg @ref LL_SYSCFG_ETH2_RMII
  *         @arg @ref LL_SYSCFG_ETH2_RGMII
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPHYInterfaceETH2(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->PMCSETR, SYSCFG_PMCSETR_ETH2_SEL));
}

/**
  * @brief  Clear Ethernet2 PHY mode
  * @rmtoll SYSCFG_PMCSETR   ETH2_SEL      LL_SYSCFG_ClearPHYInterfaceETH2
  * @param  Interface : Interface This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH2_MII
  *         @arg @ref LL_SYSCFG_ETH2_RGMII
  *         @arg @ref LL_SYSCFG_ETH2_RMII
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_ClearPHYInterfaceETH2(uint32_t Interface)
{
  MODIFY_REG(SYSCFG->PMCCLRR, SYSCFG_PMCCLRR_ETH2_SEL, Interface);
}


/**
  * @brief  Disable Ethernet2 clock
  * @rmtoll SYSCFG_PMCCLRR   ETH2_CLK_SEL       LL_SYSCFG_DisablePHYInternalClockETH2\n
  *         SYSCFG_PMCCLRR   ETH2_REF_CLK_SEL   LL_SYSCFG_DisablePHYInternalClockETH2
  * @param  Clock : This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH2_CLK
  *         @arg @ref LL_SYSCFG_ETH2_REF_CLK
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisablePHYInternalClockETH2(uint32_t Clock)
{
  MODIFY_REG(SYSCFG->PMCCLRR, (SYSCFG_PMCCLRR_ETH2_CLK_SEL | SYSCFG_PMCCLRR_ETH2_REF_CLK_SEL), Clock);
}

/**
  * @brief  Enable Ethernet2 clock
  * @rmtoll SYSCFG_PMCSETR   ETH2_CLK_SEL       LL_SYSCFG_EnablePHYInternalClockETH2\n
  *         SYSCFG_PMCSETR   ETH2_REF_CLK_SEL   LL_SYSCFG_EnablePHYInternalClockETH2
  * @param  Clock : This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH2_CLK
  *         @arg @ref LL_SYSCFG_ETH2_REF_CLK
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnablePHYInternalClockETH2(uint32_t Clock)
{
  MODIFY_REG(SYSCFG->PMCSETR, (SYSCFG_PMCSETR_ETH2_CLK_SEL | SYSCFG_PMCSETR_ETH2_REF_CLK_SEL), Clock);
}

/**
  * @brief  Enable the Analog GPIO switch to control voltage selection
  *         when the supply voltage is supplied by VDDA
  * @rmtoll SYSCFG_PMCSETR   ANASWVDD   LL_SYSCFG_EnableAnalogGpioSwitch
  * @note   Activating the gpio switch enable IOs analog switches supplied by VDDA
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableAnalogGpioSwitch(void)
{
  SET_BIT(SYSCFG->PMCSETR, SYSCFG_PMCSETR_ANASWVDD);
}

/**
  * @brief  Disable the Analog GPIO switch to control voltage selection
  *         when the supply voltage is supplied by VDDA
  * @rmtoll SYSCFG_PMCCLRR   ANASWVDD   LL_SYSCFG_DisableAnalogGpioSwitch
  * @note   Activating the gpio switch enable IOs analog switches supplied by VDDA
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableAnalogGpioSwitch(void)
{
  SET_BIT(SYSCFG->PMCCLRR, SYSCFG_PMCCLRR_ANASWVDD);
}

/**
  * @brief  Enable the Analog booster to reduce the total harmonic distortion
  *         of the analog switch when the supply voltage is lower than 2.7 V
  * @rmtoll SYSCFG_PMCSETR   EN_BOOSTER   LL_SYSCFG_EnableAnalogBooster
  * @note   Activating the booster allows to guaranty the analog switch AC performance
  *         when the supply voltage is below 2.7 V: in this case, the analog switch
  *         performance is the same on the full voltage range
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableAnalogBooster(void)
{
  SET_BIT(SYSCFG->PMCSETR, SYSCFG_PMCSETR_EN_BOOSTER);
}

/**
  * @brief  Disable the Analog booster
  * @rmtoll SYSCFG_PMCCLRR   EN_BOOSTER   LL_SYSCFG_DisableAnalogBooster
  * @note   Activating the booster allows to guaranty the analog switch AC performance
  *         when the supply voltage is below 2.7 V: in this case, the analog switch
  *         performance is the same on the full voltage range
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableAnalogBooster(void)
{
  SET_BIT(SYSCFG->PMCCLRR, SYSCFG_PMCCLRR_EN_BOOSTER);
}

/**
  * @brief  Enable the I2C fast mode plus driving capability.
  * @rmtoll SYSCFG_PMCSETR   I2Cx_FMP   LL_SYSCFG_EnableFastModePlus\n
  * @param  ConfigFastModePlus This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C1
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C2
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C3
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C4
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C5
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableFastModePlus(uint32_t ConfigFastModePlus)
{
  SET_BIT(SYSCFG->PMCSETR, ConfigFastModePlus);
}

/**
  * @brief  Disable the I2C fast mode plus driving capability.
  * @rmtoll SYSCFG_PMCCLRR   I2Cx_FMP   LL_SYSCFG_DisableFastModePlus\n
  * @param  ConfigFastModePlus This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C1
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C2
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C3
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C4
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C5
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableFastModePlus(uint32_t ConfigFastModePlus)
{
  MODIFY_REG(SYSCFG->PMCCLRR, \
             (SYSCFG_PMCCLRR_I2C1_FMP | SYSCFG_PMCCLRR_I2C2_FMP | \
              SYSCFG_PMCCLRR_I2C3_FMP | SYSCFG_PMCCLRR_I2C4_FMP | \
              SYSCFG_PMCCLRR_I2C5_FMP), ConfigFastModePlus);
}

/**
  * @brief  Enable the Compensation Cell
  * @rmtoll SYSCFG_CMPENSETR   EN   LL_SYSCFG_EnableCompensationCell
  * @param  CompCells This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MAIN_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD1_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD2_COMP_CELL
  * @note   The I/O compensation cell can be used only when the device supply
  *         voltage ranges from 2.4 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableCompensationCell(uint32_t CompCells)
{
  if ((CompCells & LL_SYSCFG_MAIN_COMP_CELL) == LL_SYSCFG_MAIN_COMP_CELL)
  {
    SET_BIT(SYSCFG->CMPENSETR, SYSCFG_CMPENSETR_EN);
  }

  if ((CompCells & LL_SYSCFG_SD1_COMP_CELL) == LL_SYSCFG_SD1_COMP_CELL)
  {
    SET_BIT(SYSCFG->CMPSD1ENSETR, SYSCFG_CMPSD1ENSETR_EN);
  }

  if ((CompCells & LL_SYSCFG_SD2_COMP_CELL) == LL_SYSCFG_SD2_COMP_CELL)
  {
    SET_BIT(SYSCFG->CMPSD2ENSETR, SYSCFG_CMPSD2ENSETR_EN);
  }
}

/**
  * @brief  Disable the Compensation Cell
  * @rmtoll SYSCFG_CMPENCLRR   EN   LL_SYSCFG_DisableCompensationCell
  * @param  CompCells This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MAIN_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD1_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD2_COMP_CELL
  * @note   The I/O compensation cell can be used only when the device supply
  *         voltage ranges from 2.4 to 3.6 V
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableCompensationCell(uint32_t CompCells)
{

  if ((CompCells & LL_SYSCFG_MAIN_COMP_CELL) == LL_SYSCFG_MAIN_COMP_CELL)
  {
    SET_BIT(SYSCFG->CMPENCLRR, SYSCFG_CMPENCLRR_EN);
  }

  if ((CompCells & LL_SYSCFG_SD1_COMP_CELL) == LL_SYSCFG_SD1_COMP_CELL)
  {
    SET_BIT(SYSCFG->CMPSD1ENCLRR, SYSCFG_CMPSD1ENCLRR_EN);
  }

  if ((CompCells & LL_SYSCFG_SD2_COMP_CELL) == LL_SYSCFG_SD2_COMP_CELL)
  {
    SET_BIT(SYSCFG->CMPSD2ENCLRR, SYSCFG_CMPSD2ENCLRR_EN);
  }
}

/**
  * @brief  Check if the Compensation Cell is enabled
  * @rmtoll SYSCFG_CMPENSETR   EN   LL_SYSCFG_IsEnabledCompensationCell
  * @param  CompCells This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MAIN_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD1_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD2_COMP_CELL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledCompensationCell(uint32_t CompCells)
{
  uint32_t status;
  if ((CompCells & LL_SYSCFG_MAIN_COMP_CELL) == LL_SYSCFG_MAIN_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPENSETR, SYSCFG_CMPENSETR_EN) == SYSCFG_CMPENSETR_EN);
  }

  if ((CompCells & LL_SYSCFG_SD1_COMP_CELL) == LL_SYSCFG_SD1_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPSD1ENSETR, SYSCFG_CMPSD1ENSETR_EN) == SYSCFG_CMPSD1ENSETR_EN);
  }

  if ((CompCells & LL_SYSCFG_SD2_COMP_CELL) == LL_SYSCFG_SD2_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPSD2ENSETR, SYSCFG_CMPSD2ENSETR_EN) == SYSCFG_CMPSD2ENSETR_EN);
  }
  return status;
}

/**
  * @brief  Get Compensation Cell ready Flag
  * @rmtoll SYSCFG_CMPCR   READY   LL_SYSCFG_IsReadyCompensationCell
  * @param  CompCells This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MAIN_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD1_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD2_COMP_CELL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsReadyCompensationCell(uint32_t CompCells)
{
  uint32_t status;
  if ((CompCells & LL_SYSCFG_MAIN_COMP_CELL) == LL_SYSCFG_MAIN_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPCR, SYSCFG_CMPCR_READY) == (SYSCFG_CMPCR_READY));
  }

  if ((CompCells & LL_SYSCFG_SD1_COMP_CELL) == LL_SYSCFG_SD1_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPSD1CR, SYSCFG_CMPSD1CR_READY) == (SYSCFG_CMPSD1CR_READY));
  }

  if ((CompCells & LL_SYSCFG_SD2_COMP_CELL) == LL_SYSCFG_SD2_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPSD2CR, SYSCFG_CMPSD2CR_READY) == (SYSCFG_CMPSD2CR_READY));
  }
  return status;
}

/**
  * @brief  To Enable optimize the I/O speed when the product voltage is low.
  * @note   This bit is active only if PRODUCT_BELOW_25V user option bit is set. It must be
  *         used only if the product supply voltage is below 2.5 V. Setting this bit when VDD is
  *         higher than 2.5 V might be destructive.
  * @param  LL_SYSCFG_HighSpeedSignal: Signal selection (TRACE, QUADSPI...)
  *   This parameter can be one or a combination of the following values:
  *   @arg LL_SYSCFG_HIGHSPEED_TRACE_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_QSPI_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_ETH1_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_ETH2_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SDMMC1_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SDMMC2_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SPI1_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SPI2_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SPI3_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SPI4_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SPI5_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_LTDC_SIGNAL
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableIOSpeedOptimization(uint32_t LL_SYSCFG_HighSpeedSignal)
{
  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_TRACE_SIGNAL) == LL_SYSCFG_HIGHSPEED_TRACE_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN0R, 0x1018U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_QSPI_SIGNAL) == LL_SYSCFG_HIGHSPEED_QSPI_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN1R, 0x1018U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_ETH1_SIGNAL) == LL_SYSCFG_HIGHSPEED_ETH1_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN2R, 0x1018U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_ETH2_SIGNAL) == LL_SYSCFG_HIGHSPEED_ETH2_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN3R, 0x1018U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SDMMC1_SIGNAL) == LL_SYSCFG_HIGHSPEED_SDMMC1_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN4R, 0x1018U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SDMMC2_SIGNAL) == LL_SYSCFG_HIGHSPEED_SDMMC2_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN5R, 0x1018U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SPI1_SIGNAL) == LL_SYSCFG_HIGHSPEED_SPI1_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN6R, 0x1018U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SPI2_SIGNAL) == LL_SYSCFG_HIGHSPEED_SPI2_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN7R, 0x1018U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SPI3_SIGNAL) == LL_SYSCFG_HIGHSPEED_SPI3_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN8R, 0x1018U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SPI4_SIGNAL) == LL_SYSCFG_HIGHSPEED_SPI4_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN9R, 0x1018U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SPI5_SIGNAL) == LL_SYSCFG_HIGHSPEED_SPI5_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN10R, 0x1018U);
  }

