zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_system.h
  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_LTDC_SIGNAL) == LL_SYSCFG_HIGHSPEED_LTDC_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN11R, 0x1018U);
  }
}

/**
  * @brief  To Disable optimize the I/O speed when the product voltage is low.
  * @note   This bit is active only if PRODUCT_BELOW_25V user option bit is set. It must be
  *         used only if the product supply voltage is below 2.5 V. Setting this bit when VDD is
  *         higher than 2.5 V might be destructive.
  * @param  LL_SYSCFG_HighSpeedSignal: Signal selection (TRACE, QUADSPI...)
  *   This parameter can be one or a combination of the following values:
  *   @arg LL_SYSCFG_HIGHSPEED_TRACE_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_QSPI_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_ETH1_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_ETH2_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SDMMC1_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SDMMC2_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SPI1_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SPI2_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SPI3_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SPI4_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SPI5_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_LTDC_SIGNAL
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableIOSpeedOptimization(uint32_t LL_SYSCFG_HighSpeedSignal)
{
  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_TRACE_SIGNAL) == LL_SYSCFG_HIGHSPEED_TRACE_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN0R, 0x0U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_QSPI_SIGNAL) == LL_SYSCFG_HIGHSPEED_QSPI_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN1R, 0x0U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_ETH1_SIGNAL) == LL_SYSCFG_HIGHSPEED_ETH1_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN2R, 0x0U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_ETH2_SIGNAL) == LL_SYSCFG_HIGHSPEED_ETH2_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN3R, 0x0U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SDMMC1_SIGNAL) == LL_SYSCFG_HIGHSPEED_SDMMC1_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN4R, 0x0U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SDMMC2_SIGNAL) == LL_SYSCFG_HIGHSPEED_SDMMC2_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN5R, 0x0U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SPI1_SIGNAL) == LL_SYSCFG_HIGHSPEED_SPI1_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN6R, 0x0U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SPI2_SIGNAL) == LL_SYSCFG_HIGHSPEED_SPI2_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN7R, 0x0U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SPI3_SIGNAL) == LL_SYSCFG_HIGHSPEED_SPI3_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN8R, 0x0U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SPI4_SIGNAL) == LL_SYSCFG_HIGHSPEED_SPI4_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN9R, 0x0U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SPI5_SIGNAL) == LL_SYSCFG_HIGHSPEED_SPI5_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN10R, 0x0U);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_LTDC_SIGNAL) == LL_SYSCFG_HIGHSPEED_LTDC_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN11R, 0x0U);
  }
}

/**
  * @brief  Check if I/O speed optimization is enabled.
  * @note   This bit is active only if PRODUCT_BELOW_25V user option bit is set. It must be
  *         used only if the product supply voltage is below 2.5 V. Setting this bit when VDD is
  *         higher than 2.5 V might be destructive.
  * @param  LL_SYSCFG_HighSpeedSignal: Signal selection (TRACE, QUADSPI...)
  *   This parameter can be one or a combination of the following values:
  *   @arg LL_SYSCFG_HIGHSPEED_TRACE_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_QSPI_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_ETH1_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_ETH2_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SDMMC1_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SDMMC2_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SPI1_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SPI2_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SPI3_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SPI4_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_SPI5_SIGNAL
  *   @arg LL_SYSCFG_HIGHSPEED_LTDC_SIGNAL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIOSpeedOptimization(uint32_t LL_SYSCFG_HighSpeedSignal)
{
  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_TRACE_SIGNAL) == LL_SYSCFG_HIGHSPEED_TRACE_SIGNAL)
  {
    return (uint32_t)(READ_BIT(SYSCFG->HSLVEN0R, SYSCFG_HSLVEN0R_HSLVEN_TRACE) == SYSCFG_HSLVEN0R_HSLVEN_TRACE);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_QSPI_SIGNAL) == LL_SYSCFG_HIGHSPEED_QSPI_SIGNAL)
  {
    return (uint32_t)(READ_BIT(SYSCFG->HSLVEN1R, SYSCFG_HSLVEN1R_HSLVEN_QSPI) == SYSCFG_HSLVEN1R_HSLVEN_QSPI);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_ETH1_SIGNAL) == LL_SYSCFG_HIGHSPEED_ETH1_SIGNAL)
  {
    return (uint32_t)(READ_BIT(SYSCFG->HSLVEN2R, SYSCFG_HSLVEN2R_HSLVEN_ETH1) == SYSCFG_HSLVEN2R_HSLVEN_ETH1);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_ETH2_SIGNAL) == LL_SYSCFG_HIGHSPEED_ETH2_SIGNAL)
  {
    return (uint32_t)(READ_BIT(SYSCFG->HSLVEN3R, SYSCFG_HSLVEN3R_HSLVEN_ETH2) == SYSCFG_HSLVEN3R_HSLVEN_ETH2);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SDMMC1_SIGNAL) == LL_SYSCFG_HIGHSPEED_SDMMC1_SIGNAL)
  {
    return (uint32_t)(READ_BIT(SYSCFG->HSLVEN4R, SYSCFG_HSLVEN4R_HSLVEN_SDMMC1) == SYSCFG_HSLVEN4R_HSLVEN_SDMMC1);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SDMMC2_SIGNAL) == LL_SYSCFG_HIGHSPEED_SDMMC2_SIGNAL)
  {
    return (uint32_t)(READ_BIT(SYSCFG->HSLVEN5R, SYSCFG_HSLVEN5R_HSLVEN_SDMMC2) == SYSCFG_HSLVEN5R_HSLVEN_SDMMC2);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SPI1_SIGNAL) == LL_SYSCFG_HIGHSPEED_SPI1_SIGNAL)
  {
    return (uint32_t)(READ_BIT(SYSCFG->HSLVEN6R, SYSCFG_HSLVEN6R_HSLVEN_SPI1) == SYSCFG_HSLVEN6R_HSLVEN_SPI1);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SPI2_SIGNAL) == LL_SYSCFG_HIGHSPEED_SPI2_SIGNAL)
  {
    return (uint32_t)(READ_BIT(SYSCFG->HSLVEN7R, SYSCFG_HSLVEN7R_HSLVEN_SPI2) == SYSCFG_HSLVEN7R_HSLVEN_SPI2);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SPI3_SIGNAL) == LL_SYSCFG_HIGHSPEED_SPI3_SIGNAL)
  {
    return (uint32_t)(READ_BIT(SYSCFG->HSLVEN8R, SYSCFG_HSLVEN8R_HSLVEN_SPI3) == SYSCFG_HSLVEN8R_HSLVEN_SPI3);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SPI4_SIGNAL) == LL_SYSCFG_HIGHSPEED_SPI4_SIGNAL)
  {
    return (uint32_t)(READ_BIT(SYSCFG->HSLVEN9R, SYSCFG_HSLVEN9R_HSLVEN_SPI4) == SYSCFG_HSLVEN9R_HSLVEN_SPI4);
  }

  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_SPI5_SIGNAL) == LL_SYSCFG_HIGHSPEED_SPI5_SIGNAL)
  {
    return (uint32_t)(READ_BIT(SYSCFG->HSLVEN10R, SYSCFG_HSLVEN10R_HSLVEN_SPI5) == SYSCFG_HSLVEN10R_HSLVEN_SPI5);
  }

