zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_system.h
  if ((LL_SYSCFG_HighSpeedSignal & LL_SYSCFG_HIGHSPEED_LTDC_SIGNAL) == LL_SYSCFG_HIGHSPEED_LTDC_SIGNAL)
  {
    return (uint32_t)(READ_BIT(SYSCFG->HSLVEN11R, SYSCFG_HSLVEN11R_HSLVEN_LTDC) == SYSCFG_HSLVEN11R_HSLVEN_LTDC);
  }
}


/**
  * @brief  Set the code selection for the I/O Compensation cell
  * @rmtoll SYSCFG_CMPCR   SW_CTRL   LL_SYSCFG_SetCellCompensationCode
  * @param  CompCode: Selects the code to be applied for the I/O compensation cell
  *   This parameter can be one of the following values:
  *   @arg LL_SYSCFG_CELL_CODE : Select Code from the cell
  *   @arg LL_SYSCFG_REGISTER_CODE: Select Code from the SYSCFG compensation cell code register
  * @param  CompCells This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MAIN_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD1_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD2_COMP_CELL
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetCellCompensationCode(uint32_t CompCells, uint32_t CompCode)
{
  if ((CompCells & LL_SYSCFG_MAIN_COMP_CELL) == LL_SYSCFG_MAIN_COMP_CELL)
  {
    SET_BIT(SYSCFG->CMPCR, CompCode);
  }
  if ((CompCells & LL_SYSCFG_SD1_COMP_CELL) == LL_SYSCFG_SD1_COMP_CELL)
  {
    SET_BIT(SYSCFG->CMPSD1CR, CompCode);
  }
  if ((CompCells & LL_SYSCFG_SD2_COMP_CELL) == LL_SYSCFG_SD2_COMP_CELL)
  {
    SET_BIT(SYSCFG->CMPSD2CR, CompCode);
  }
}

/**
  * @brief  Get the code selected for the I/O Compensation cell
  * @rmtoll SYSCFG_CMPCR   SW_CTRL   LL_SYSCFG_GetCellCompensationCode
  * @param  CompCells This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MAIN_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD1_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD2_COMP_CELL
  * @retval Returned value can be one of the following values:
  *   @arg LL_SYSCFG_CELL_CODE : Selected Code is from the cell
  *   @arg LL_SYSCFG_REGISTER_CODE: Selected Code is from the SYSCFG compensation cell code register
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetCellCompensationCode(uint32_t CompCells)
{
  uint32_t status;
  if ((CompCells & LL_SYSCFG_MAIN_COMP_CELL) == LL_SYSCFG_MAIN_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPCR, SYSCFG_CMPCR_SW_CTRL));
  }
  if ((CompCells & LL_SYSCFG_SD1_COMP_CELL) == LL_SYSCFG_SD1_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPSD1CR, SYSCFG_CMPSD1CR_SW_CTRL));
  }
  if ((CompCells & LL_SYSCFG_SD2_COMP_CELL) == LL_SYSCFG_SD2_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPSD2CR, SYSCFG_CMPSD2CR_SW_CTRL));
  }
  return status;
}

/**
  * @brief  Get I/O compensation cell value for PMOS transistors
  * @rmtoll SYSCFG_CMPCR   APSRC   LL_SYSCFG_GetPMOSCompensationValue
  * @param  CompCells This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MAIN_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD1_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD2_COMP_CELL
  * @retval Returned value is the I/O compensation cell value for PMOS transistors
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSCompensationValue(uint32_t CompCells)
{
  uint32_t status;
  if ((CompCells & LL_SYSCFG_MAIN_COMP_CELL) == LL_SYSCFG_MAIN_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPCR, SYSCFG_CMPCR_APSRC));
  }
  if ((CompCells & LL_SYSCFG_SD1_COMP_CELL) == LL_SYSCFG_SD1_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPSD1CR, SYSCFG_CMPCR_APSRC));
  }
  if ((CompCells & LL_SYSCFG_SD2_COMP_CELL) == LL_SYSCFG_SD2_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPSD2CR, SYSCFG_CMPCR_APSRC));
  }
  return status;
}

/**
  * @brief  Get I/O compensation cell value for NMOS transistors
  * @rmtoll SYSCFG_CMPCR   ANSRC   LL_SYSCFG_GetNMOSCompensationValue
  * @param  CompCells This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MAIN_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD1_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD2_COMP_CELL
  * @retval Returned value is the I/O compensation cell value for NMOS transistors
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSCompensationValue(uint32_t CompCells)
{
  uint32_t status;
  if ((CompCells & LL_SYSCFG_MAIN_COMP_CELL) == LL_SYSCFG_MAIN_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPCR, SYSCFG_CMPCR_ANSRC));
  }
  if ((CompCells & LL_SYSCFG_SD1_COMP_CELL) == LL_SYSCFG_SD1_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPSD1CR, SYSCFG_CMPCR_ANSRC));
  }
  if ((CompCells & LL_SYSCFG_SD2_COMP_CELL) == LL_SYSCFG_SD2_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPSD2CR, SYSCFG_CMPCR_ANSRC));
  }
  return status;
}

/**
  * @brief  Set I/O compensation cell code for PMOS transistors
  * @rmtoll SYSCFG_CMPCR   RAPSRC   LL_SYSCFG_SetPMOSCompensationCode
  * @param  CompCells This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MAIN_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD1_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD2_COMP_CELL
  * @param  PMOSCode PMOS compensation code
  *         This code is applied to the I/O compensation cell when the CS bit of the
  *         SYSCFG_CMPCR is set
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetPMOSCompensationCode(uint32_t CompCells, uint32_t PMOSCode)
{
  if ((CompCells & LL_SYSCFG_MAIN_COMP_CELL) == LL_SYSCFG_MAIN_COMP_CELL)
  {
    MODIFY_REG(SYSCFG->CMPCR, SYSCFG_CMPCR_RAPSRC, PMOSCode);
  }
  if ((CompCells & LL_SYSCFG_SD1_COMP_CELL) == LL_SYSCFG_SD1_COMP_CELL)
  {
    MODIFY_REG(SYSCFG->CMPSD1CR, SYSCFG_CMPSD1CR_RAPSRC, PMOSCode);
  }
  if ((CompCells & LL_SYSCFG_SD2_COMP_CELL) == LL_SYSCFG_SD2_COMP_CELL)
  {
    MODIFY_REG(SYSCFG->CMPSD2CR, SYSCFG_CMPSD2CR_RAPSRC, PMOSCode);
  }
}

/**
  * @brief  Get I/O compensation cell code for PMOS transistors
  * @rmtoll SYSCFG_CMPCR   RAPSRC   LL_SYSCFG_GetPMOSCompensationCode
  * @param  CompCells This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MAIN_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD1_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD2_COMP_CELL
  * @retval Returned value is the I/O compensation cell code for PMOS transistors
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSCompensationCode(uint32_t CompCells)
{
  uint32_t status;
  if ((CompCells & LL_SYSCFG_MAIN_COMP_CELL) == LL_SYSCFG_MAIN_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPCR, SYSCFG_CMPCR_RAPSRC));
  }
  if ((CompCells & LL_SYSCFG_SD1_COMP_CELL) == LL_SYSCFG_SD1_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPSD1CR, SYSCFG_CMPCR_RAPSRC));
  }
  if ((CompCells & LL_SYSCFG_SD2_COMP_CELL) == LL_SYSCFG_SD2_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPSD2CR, SYSCFG_CMPCR_RAPSRC));
  }
  return status;
}

/**
  * @brief  Set I/O compensation cell code for NMOS transistors
  * @rmtoll SYSCFG_CMPCR   RANSRC   LL_SYSCFG_SetNMOSCompensationCode
  * @param  CompCells This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MAIN_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD1_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD2_COMP_CELL
  * @param  NMOSCode: NMOS compensation code
  *         This code is applied to the I/O compensation cell when the CS bit of the
  *         SYSCFG_CMPCR is set
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetNMOSCompensationCode(uint32_t CompCells, uint32_t NMOSCode)
{
  if ((CompCells & LL_SYSCFG_MAIN_COMP_CELL) == LL_SYSCFG_MAIN_COMP_CELL)
  {
    MODIFY_REG(SYSCFG->CMPCR, SYSCFG_CMPCR_RANSRC, NMOSCode);
  }
  if ((CompCells & LL_SYSCFG_SD1_COMP_CELL) == LL_SYSCFG_SD1_COMP_CELL)
  {
    MODIFY_REG(SYSCFG->CMPSD1CR, SYSCFG_CMPSD1CR_RANSRC, NMOSCode);
  }
  if ((CompCells & LL_SYSCFG_SD2_COMP_CELL) == LL_SYSCFG_SD2_COMP_CELL)
  {
    MODIFY_REG(SYSCFG->CMPSD2CR, SYSCFG_CMPSD2CR_RANSRC, NMOSCode);
  }
}

/**
  * @brief  Get I/O compensation cell code for NMOS transistors
  * @rmtoll SYSCFG_CMPCR   RANSRC   LL_SYSCFG_GetNMOSCompensationCode
  * @param  CompCells This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MAIN_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD1_COMP_CELL
  *         @arg @ref LL_SYSCFG_SD2_COMP_CELL
  * @retval Returned value is the I/O compensation cell code for NMOS transistors
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSCompensationCode(uint32_t CompCells)
{
  uint32_t status;
  if ((CompCells & LL_SYSCFG_MAIN_COMP_CELL) == LL_SYSCFG_MAIN_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPCR, SYSCFG_CMPCR_RANSRC));
  }
  if ((CompCells & LL_SYSCFG_SD1_COMP_CELL) == LL_SYSCFG_SD1_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPSD1CR, SYSCFG_CMPCR_RANSRC));
  }
  if ((CompCells & LL_SYSCFG_SD2_COMP_CELL) == LL_SYSCFG_SD2_COMP_CELL)
  {
    status = (uint32_t)(READ_BIT(SYSCFG->CMPSD2CR, SYSCFG_CMPCR_RANSRC));
  }
  return status;
}

/**
  * @brief  Set connections to TIM1/8/15/16/17 Break inputs
  * @note this feature is available on STM32MP1 rev.B and above
  * @rmtoll SYSCFG_CBR   PVDL   LL_SYSCFG_SetTIMBreakInputs
  * @param  Break This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_TIMBREAK_PVD
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetTIMBreakInputs(uint32_t Break)
{
  MODIFY_REG(SYSCFG->CBR,  SYSCFG_CBR_PVDL, Break);
}

/**
  * @brief  Get connections to TIM1/8/15/16/17 Break inputs
  * @note this feature is available on STM32MP1 rev.B and above
  * @rmtoll
  *         SYSCFG_CBR   PVDL   LL_SYSCFG_GetTIMBreakInputs
  *         @arg @ref LL_SYSCFG_TIMBREAK_PVD
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetTIMBreakInputs(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CBR,  SYSCFG_CBR_PVDL));
}


/**
  * @}
  */

/** @defgroup SYSTEM_LL_EF_DBGMCU DBGMCU
  * @{
  */

/**
  * @brief  Return the device identifier
  * @rmtoll DBGMCU_IDCODE DEV_ID        LL_DBGMCU_GetDeviceID
  * @retval Values between Min_Data=0x00 and Max_Data=0xFFF
  */
__STATIC_INLINE uint32_t LL_DBGMCU_GetDeviceID(void)
{
  return (uint32_t)(READ_BIT(DBGMCU->IDCODE, DBGMCU_IDCODE_DEV_ID));
}

/**
  * @brief  Return the device revision identifier
  * @note This field indicates the revision of the device.
          For example, it is read as RevA -> 0x1000, Cat 2 revZ -> 0x1001
  * @rmtoll DBGMCU_IDCODE REV_ID        LL_DBGMCU_GetRevisionID
  * @retval Values between Min_Data=0x00 and Max_Data=0xFFFF
  */
__STATIC_INLINE uint32_t LL_DBGMCU_GetRevisionID(void)
{
  return (uint32_t)(READ_BIT(DBGMCU->IDCODE, DBGMCU_IDCODE_REV_ID) >> DBGMCU_IDCODE_REV_ID_Pos);
}

/**
  * @brief  Enable D1 Domain debug during Low Power mode
  * @rmtoll DBGMCU_CR   DBG_DBGLP   LL_DBGMCU_EnableDebugInLowPowerMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_EnableDebugInLowPowerMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_DBGLP);
}

/**
  * @brief  Disable D1 Domain debug during Low Power mode
  * @rmtoll DBGMCU_CR   DBG_DBGLP   LL_DBGMCU_DisableDebugInLowPowerMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_DisableDebugInLowPowerMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_DBGLP);
}

/**
  * @brief  Freeze APB1 group1 peripherals
  * @rmtoll DBGMCU_APB1FZ1   TIM2      LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ1   TIM3      LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ1   TIM4      LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ1   TIM5      LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ1   TIM6      LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ1   TIM7      LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ1   LPTIM1    LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ1   I2C1      LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  *         DBGMCU_APB1FZ1   I2C2      LL_DBGMCU_APB1_GRP1_FreezePeriph\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM2_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM3_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM4_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM5_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM6_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM7_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_LPTIM1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C2_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB1_GRP1_FreezePeriph(uint32_t Periphs)
{
  SET_BIT(DBGMCU->APB1FZ1, Periphs);
}

/**
  * @brief  Unfreeze APB1 group1 peripherals
  * @rmtoll DBGMCU_APB1FZ1   TIM2      LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ1   TIM3      LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ1   TIM4      LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ1   TIM5      LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ1   TIM6      LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ1   TIM7      LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ1   LPTIM1    LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ1   I2C1      LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB1FZ1   I2C2      LL_DBGMCU_APB1_GRP1_UnFreezePeriph\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM2_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM3_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM4_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM5_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM6_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM7_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_LPTIM1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C2_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB1_GRP1_UnFreezePeriph(uint32_t Periphs)
{
  CLEAR_BIT(DBGMCU->APB1FZ1, Periphs);
}

/**
  * @brief  Freeze APB2 group1 peripherals
  * @rmtoll DBGMCU_APB2FZ1   TIM1    LL_DBGMCU_APB2_GRP1_FreezePeriph\n
  *         DBGMCU_APB2FZ1   TIM8    LL_DBGMCU_APB2_GRP1_FreezePeriph\n
  *         DBGMCU_APB2FZ1   FDCAN   LL_DBGMCU_APB2_GRP1_FreezePeriph\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM1_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM8_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_FDCAN_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB2_GRP1_FreezePeriph(uint32_t Periphs)
{
  SET_BIT(DBGMCU->APB2FZ1, Periphs);
}

/**
  * @brief  Unfreeze APB2 group1 peripherals
  * @rmtoll DBGMCU_APB2FZ1   TIM1    LL_DBGMCU_APB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB2FZ1   TIM8    LL_DBGMCU_APB2_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB2FZ1   FDCAN   LL_DBGMCU_APB2_GRP1_UnFreezePeriph\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM1_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM8_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_FDCAN_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB2_GRP1_UnFreezePeriph(uint32_t Periphs)
{
  CLEAR_BIT(DBGMCU->APB2FZ1, Periphs);
}

/**
  * @brief  Freeze APB3 peripherals
  * @rmtoll DBGMCU_APB3FZ1    LPTIM2    LL_DBGMCU_APB3_GRP1_FreezePeriph\n
  *         DBGMCU_APB3FZ1    LPTIM3    LL_DBGMCU_APB3_GRP1_FreezePeriph\n
  *         DBGMCU_APB3FZ1    LPTIM4    LL_DBGMCU_APB3_GRP1_FreezePeriph\n
  *         DBGMCU_APB3FZ1    LPTIM5    LL_DBGMCU_APB3_GRP1_FreezePeriph\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB3_GRP1_LPTIM2_STOP
  *         @arg @ref LL_DBGMCU_APB3_GRP1_LPTIM3_STOP
  *         @arg @ref LL_DBGMCU_APB3_GRP1_LPTIM4_STOP
  *         @arg @ref LL_DBGMCU_APB3_GRP1_LPTIM5_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB3_GRP1_FreezePeriph(uint32_t Periphs)
{
  SET_BIT(DBGMCU->APB3FZ1, Periphs);
}

/**
  * @brief  Unfreeze APB3 peripherals
  * @rmtoll DBGMCU_APB3FZ1    LPTIM2    LL_DBGMCU_APB3_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB3FZ1    LPTIM3    LL_DBGMCU_APB3_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB3FZ1    LPTIM4    LL_DBGMCU_APB3_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB3FZ1    LPTIM5    LL_DBGMCU_APB3_GRP1_UnFreezePeriph\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB3_GRP1_LPTIM2_STOP
  *         @arg @ref LL_DBGMCU_APB3_GRP1_LPTIM3_STOP
  *         @arg @ref LL_DBGMCU_APB3_GRP1_LPTIM4_STOP
  *         @arg @ref LL_DBGMCU_APB3_GRP1_LPTIM5_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB3_GRP1_UnFreezePeriph(uint32_t Periphs)
{
  CLEAR_BIT(DBGMCU->APB3FZ1, Periphs);
}

/**
  * @brief  Freeze APB4 peripherals
  * @rmtoll DBGMCU_APB4FZ1    IWDG2     LL_DBGMCU_APB4_GRP1_FreezePeriph\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB4_GRP1_IWDG2_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB4_GRP1_FreezePeriph(uint32_t Periphs)
{
  SET_BIT(DBGMCU->APB4FZ1, Periphs);
}

/**
  * @brief  Unfreeze APB4 peripherals
  * @rmtoll DBGMCU_APB4FZ1    IWDG2    LL_DBGMCU_APB4_GRP1_UnFreezePeriph\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB4_GRP1_IWDG2_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB4_GRP1_UnFreezePeriph(uint32_t Periphs)
{
  CLEAR_BIT(DBGMCU->APB4FZ1, Periphs);
}

/**
  * @brief  Freeze APB5 peripherals
  * @rmtoll DBGMCU_APB5FZ1    IWDG1     LL_DBGMCU_APB5_GRP1_FreezePeriph\n
  *         DBGMCU_APB5FZ1    RTC       LL_DBGMCU_APB5_GRP1_FreezePeriph\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB5_GRP1_IWDG1_STOP
  *         @arg @ref LL_DBGMCU_APB5_GRP1_RTC_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB5_GRP1_FreezePeriph(uint32_t Periphs)
{
  SET_BIT(DBGMCU->APB5FZ1, Periphs);
}

/**
  * @brief  Unfreeze APB5 peripherals
  * @rmtoll DBGMCU_APB5FZ2    IWDG1     LL_DBGMCU_APB5_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB5FZ2    RTC       LL_DBGMCU_APB5_GRP1_UnFreezePeriph\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB5_GRP1_IWDG1_STOP
  *         @arg @ref LL_DBGMCU_APB5_GRP1_RTC_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB5_GRP1_UnFreezePeriph(uint32_t Periphs)
{
  CLEAR_BIT(DBGMCU->APB5FZ1, Periphs);
}

/**
  * @brief  Freeze APB6 peripherals
  * @rmtoll DBGMCU_APB6FZ1    I2C3      LL_DBGMCU_APB6_GRP1_FreezePeriph\n
  *         DBGMCU_APB6FZ1    I2C4      LL_DBGMCU_APB6_GRP1_FreezePeriph\n
  *         DBGMCU_APB6FZ1    I2C5      LL_DBGMCU_APB6_GRP1_FreezePeriph\n
  *         DBGMCU_APB6FZ1    TIM12     LL_DBGMCU_APB6_GRP1_FreezePeriph\n
  *         DBGMCU_APB6FZ1    TIM13     LL_DBGMCU_APB6_GRP1_FreezePeriph\n
  *         DBGMCU_APB6FZ1    TIM14     LL_DBGMCU_APB6_GRP1_FreezePeriph\n
  *         DBGMCU_APB6FZ1    TIM15     LL_DBGMCU_APB6_GRP1_FreezePeriph\n
  *         DBGMCU_APB6FZ1    TIM16     LL_DBGMCU_APB6_GRP1_FreezePeriph\n
  *         DBGMCU_APB6FZ1    TIM17     LL_DBGMCU_APB6_GRP1_FreezePeriph\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB6_GRP1_I2C3_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_I2C4_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_I2C5_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_TIM12_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_TIM13_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_TIM14_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_TIM15_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_TIM16_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_TIM17_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB6_GRP1_FreezePeriph(uint32_t Periphs)
{
  SET_BIT(DBGMCU->APB6FZ1, Periphs);
}

/**
  * @brief  Unfreeze APB6 peripherals
  * @rmtoll DBGMCU_APB6FZ1    I2C3      LL_DBGMCU_APB6_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB6FZ1    I2C4      LL_DBGMCU_APB6_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB6FZ1    I2C5      LL_DBGMCU_APB6_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB6FZ1    TIM12     LL_DBGMCU_APB6_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB6FZ1    TIM13     LL_DBGMCU_APB6_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB6FZ1    TIM14     LL_DBGMCU_APB6_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB6FZ1    TIM15     LL_DBGMCU_APB6_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB6FZ1    TIM16     LL_DBGMCU_APB6_GRP1_UnFreezePeriph\n
  *         DBGMCU_APB6FZ1    TIM17     LL_DBGMCU_APB6_GRP1_UnFreezePeriph\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB6_GRP1_I2C3_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_I2C4_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_I2C5_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_TIM12_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_TIM13_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_TIM14_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_TIM15_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_TIM16_STOP
  *         @arg @ref LL_DBGMCU_APB6_GRP1_TIM17_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB6_GRP1_UnFreezePeriph(uint32_t Periphs)
{
  CLEAR_BIT(DBGMCU->APB6FZ1, Periphs);
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (SYSCFG) || defined (DBGMCU) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP13xx_LL_SYSTEM_H */
